Repository: 0xced/MSBuildStructuredLog
Catalog: src/StructuredLogger/Properties/Resources.*.resx
Languages: de, ko

# OutputItemParameterMessagePrefix
source: Output Item(s):
de: Ausgegebene Elemente:
ko: Выходных элементов:

# ProjectImportSkippedEmptyFile
source: Project "{0}" was not imported by "{1}" at ({2},{3}), due to the file being empty.
de: Das Projekt "{0}" wurde von "{1}" nicht in ({2},{3}) importiert, da die Datei leer war.
ko: Проект "{0}" не был импортирован "{1}" в ({2},{3}), так как файл пуст.

# TaskFound
source: Using "{0}" task from assembly "{1}".
de: Die {0}-Aufgabe aus der {1}-Assembly wird verwendet.
ko: Используется задача "{0}" из сборки "{1}".

# ToolsVersionInEffectForBuild
source: Building with tools version "{0}".
de: Erstellung mit der Toolsversion "{0}".
ko: Сборка с инструментами версии "{0}".

# OverridingTarget
source: Overriding target "{0}" in project "{1}" with target "{2}" from project "{3}".
de: Das Ziel "{0}" im Projekt "{1}" wird durch das Ziel "{2}" aus dem Projekt "{3}" außer Kraft gesetzt.
ko: Переопределение целевого объекта "{0}" в проекте "{1}" целевым объект "{2}" из проекта "{3}".

# TargetSkippedWhenSkipNonexistentTargets
source: Target "{0}" skipped. The target does not exist in the project and SkipNonexistentTargets is set to true.
de: Das Ziel "{0}" wurde übersprungen. Das Ziel ist im Projekt nicht vorhanden, und "SkipNonexistentTargets" ist auf TRUE festgelegt.
ko: Целевой объект "{0}" пропущен. Целевой объект не существует в проекте, а SkipNonexistentTargets имеет значение "Истина".

# ProjectImportSkippedFalseCondition
source: Project "{0}" was not imported by "{1}" at ({2},{3}), due to false condition; ({4}) was evaluated as ({5}).
de: Das Projekt "{0}" wurde aufgrund einer falschen Bedingung nicht von "{1}" in ({2},{3}) importiert; ({4}) wurde als ({5}) ausgewertet.
ko: Проект "{0}" не был импортирован "{1}" в ({2},{3}) из-за ложного условия; ({4}) вычислено как ({5}).

# ProjectImportSkippedNoMatches
source: Project "{0}" was not imported by "{1}" at ({2},{3}), due to no matching files.
de: Das Projekt "{0}" wurde aufgrund nicht übereinstimmender Dateien nicht von "{1}" in ({2},{3}) importiert.
ko: Проект "{0}" не был импортирован "{1}" в ({2},{3}), так как совпадающих файлов нет.

# SearchPathsForMSBuildExtensionsPath
source: Search paths being used for {0} are {1}
de: Für {0} verwendete Suchpfade sind {1}.
ko: Пути поиска, используемые для {0}: {1}

# TaskParameterPrefix
source: Task Parameter:
de: Aufgabenparameter:
ko: Параметр задачи:

# DuplicateImport
source: MSB4011: "{0}" cannot be imported again. It was already imported at "{1}". This is most likely a build authoring error. This subsequent import will be ignored. {2}
de: MSB4011: "{0}" kann nicht erneut importiert werden. Es wurde bereits bei "{1}" importiert. Es handelt sich aller Wahrscheinlichkeit nach um einen Buildautorisierungsfehler. Der darauf folgende Import wird ignoriert. {2}
ko: MSB4011: невозможно повторно импортировать "{0}". Он уже был импортирован в "{1}". Скорее всего это связано с ошибкой при написании кода сборки. Повторный импорт будет пропущен. {2}

# TargetAlreadyCompleteFailure
source: Target "{0}" skipped. Previously built unsuccessfully.
de: Das Ziel "{0}" wurde übersprungen. Die vorherige Erstellung war nicht erfolgreich.
ko: Целевой объект "{0}" пропущен. Предыдущая сборка неуспешна.

# General.OverridingProperties
source: Overriding Global Properties for project "{0}" with:
de: Die globalen Eigenschaften für das Projekt "{0}" werden außer Kraft gesetzt durch:
ko: Переопределение глобальных свойств для проекта "{0}" с:

# ItemGroupRemoveLogMessage
source: Removed Item(s):
de: Entfernte Elemente:
ko: Удалено элементов:

# ProjectImported
source: Importing project "{0}" into project "{1}" at ({2},{3}).
de: Das Projekt "{0}" wird in das Projekt "{1}" bei ({2},{3}) importiert.
ko: Импортируется проект "{0}" в проект "{1}" в ({2},{3}).

# PropertyGroupLogMessage
source: Set Property: {0}={1}
de: Festgelegte Eigenschaft: {0}={1}
ko: Задать свойство: {0}={1}

# General.AdditionalProperties
source: Additional Properties for project "{0}":
de: Weitere Eigenschaften für das Projekt "{0}":
ko: Дополнительные свойства для проекта "{0}":

# TargetDoesNotExistBeforeTargetMessage
source: The target "{0}" listed in a BeforeTargets attribute at "{1}" does not exist in the project, and will be ignored.
de: Das in einem BeforeTargets-Attribut bei "{1}" aufgeführte Ziel "{0}" ist nicht im Projekt vorhanden und wird daher ignoriert.
ko: Целевой объект "{0}", указанный в атрибуте BeforeTargets для "{1}", не существует в проекте и будет пропущен.

# TaskFoundFromFactory
source: Using "{0}" task from the task factory "{1}".
de: Die {0}-Aufgabe aus der Aufgabenfactory "{1}" wird verwendet.
ko: Используется задача "{0}" из фабрики заданий "{1}".

# ProjectImportSkippedMissingFile
source: Project "{0}" was not imported by "{1}" at ({2},{3}), due to the file not existing.
de: Das Projekt "{0}" wurde von "{1}" nicht in ({2},{3}) importiert, weil die Datei nicht vorhanden ist.
ko: Проект "{0}" не был импортирован "{1}" в ({2},{3}), так как файл не существует.

# TargetSkippedFalseCondition
source: Target "{0}" skipped, due to false condition; ({1}) was evaluated as ({2}).
de: Das Ziel "{0}" wurde übersprungen, da die Bedingung "false" war . ({1}) wurde als ({2}) ausgewertet.
ko: Целевой объект "{0}" пропущен из-за невыполненного условия; выражение ({1}) равно ({2}).

# TaskSkippedFalseCondition
source: Task "{0}" skipped, due to false condition; ({1}) was evaluated as ({2}).
de: Die {0}-Aufgabe wurde übersprungen, da die Bedingung "false" war . ({1}) wurde als ({2}) ausgewertet.
ko: Задача "{0}" пропущена из-за невыполненного условия; выражение ({1}) равно ({2}).

# ItemGroupIncludeLogMessagePrefix
source: Added Item(s):
de: Hinzugefügte Elemente:
ko: Добавлено элементов:

# OutputPropertyLogMessage
source: Output Property: {0}={1}
de: Ausgegebene Eigenschaft: {0}={1}
ko: Выходное свойство: {0}={1}

# ProjectImportSkippedInvalidFile
source: Project "{0}" was not imported by "{1}" at ({2},{3}), due to the file being invalid.
de: Das Projekt "{0}" wurde von "{1}" nicht in ({2},{3}) importiert, weil die Datei ungültig ist.
ko: Проект "{0}" не был импортирован "{1}" в ({2},{3}), так как файл недопустим.

# TargetAlreadyCompleteSuccess
source: Target "{0}" skipped. Previously built successfully.
de: Das Ziel "{0}" wurde übersprungen. Die vorherige Erstellung war erfolgreich.
ko: Целевой объект "{0}" пропущен. Предыдущая сборка успешна.

# TryingExtensionsPath
source: Trying to import {0} using extensions path {1}
de: Versucht {0} mithilfe des Erweiterungspfad {1} zu importieren.
ko: Попытка импортировать "{0}" с помощью пути расширений {1}

# PropertyReassignment
source: Property reassignment: $({0})="{1}" (previous value: "{2}") at {3}
de: Neuzuweisung der Eigenschaft: $({0})="{1}" (vorheriger Wert: "{2}") unter {3}
ko: Повторное назначение свойства: $({0})="{1}" (предыдущее значение: "{2}") для {3}

# General.GlobalProperties
source: Global Properties:
de: Globale Eigenschaften:
ko: Глобальные свойства:

# General.UndefineProperties
source: Removing Properties:
de: Eigenschaften werden entfernt:
ko: Удаление свойств:

# ResolveAssemblyReference.UnifiedPrimaryReference
source: Unified primary reference "{0}".
de: Vereinheitlichter Primärverweis "{0}".
ko: Объединенная первичная ссылка "{0}".

# ResolveAssemblyReference.AssemblyFoldersExSearchLocations
source: AssemblyFoldersEx location: "{0}"
de: Speicherort von AssemblyFoldersEx: "{0}"
ko: Расположение AssemblyFoldersEx: "{0}"

# GetSDKReferenceFiles.ConflictReferenceDifferentSDK
source: There was a conflict between two references with the same file name between the "{0}" and "{1}" SDKs. Choosing "{2}" over "{3}" because it was resolved first.
de: Konflikt zwischen zwei Verweisen mit demselben Dateinamen zwischen den SDKs "{0}" und "{1}". "{2}" wird "{3}" gegenüber bevorzugt, da es zuerst aufgelöst wurde.
ko: Конфликт между двумя ссылками с одинаковым именем файла для пакетов SDK "{0}" и "{1}". Выбирается "{2}", а не "{3}", поскольку она была разрешена первой.

# ResolveAssemblyReference.Dependency
source: Dependency "{0}".
de: Abhängigkeit "{0}".
ko: Зависимость "{0}".

# ResolveAssemblyReference.PrimaryReference
source: Primary reference "{0}".
de: Primärverweis "{0}".
ko: Первичная ссылка "{0}".

# Copy.HardLinkComment
source: Creating hard link to copy "{0}" to "{1}".
de: Es wird ein fester Link erstellt, um "{0}" in "{1}" zu kopieren.
ko: Создание жесткой связи для копирования "{0}" в "{1}".

# Copy.DidNotCopyBecauseOfFileMatch
source: Did not copy from file "{0}" to file "{1}" because the "{2}" parameter was set to "{3}" in the project and the files' sizes and timestamps match.
de: Die Datei "{0}" wurde nicht in die Datei "{1}" kopiert, da der {2}-Parameter im Projekt auf "{3}" festgelegt war und die Größen und Timestamps der Dateien übereinstimmen.
ko: Копирование из файла "{0}" в файл "{1}" не выполнялось, так как для параметра "{2}" в проекте было задано значение "{3}", а размеры файлов и отметки времени совпадают.

# ResolveAssemblyReference.SearchPath
source: For SearchPath "{0}".
de: Für SearchPath "{0}".
ko: Для SearchPath "{0}".

# ResolveAssemblyReference.UnifiedDependency
source: Unified Dependency "{0}".
de: Vereinheitlichte Abhängigkeit "{0}".
ko: Объединенная зависимость "{0}".

# GetSDKReferenceFiles.ConflictReferenceSameSDK
source: There was a conflict between two references with the same file name resolved within the "{0}" SDK. Choosing "{1}" over "{2}" because it was resolved first.
de: Konflikt zwischen zwei Verweisen im SDK "{0}", die mit demselben Dateinamen aufgelöst wurden. "{1}" wird "{2}" gegenüber bevorzugt, da es zuerst aufgelöst wurde.
ko: Конфликт между двумя ссылками с одинаковым именем файла, разрешаемыми в пакете SDK "{0}". Выбирается "{1}", а не "{2}", поскольку она была разрешена первой.

# GetSDKReferenceFiles.ConflictRedistDifferentSDK
source: There was a conflict between two files from the redist folder files going to the same target path "{0}" between the "{1}" and "{2}" SDKs. Choosing "{3}" over "{4}" because it was resolved first.
de: Konflikt zwischen zwei Dateien aus redist-Ordner für denselben Zielpfad "{0}" zwischen den SDKs "{1}" und "{2}". "{3}" wird "{4}" gegenüber bevorzugt, da es zuerst aufgelöst wurde.
ko: Конфликт между двумя файлами из папки распространяемого пакета, которые разрешаются в один целевой путь "{0}" для пакетов SDK "{1}" и "{2}". Выбирается "{3}", а не "{4}", поскольку он был разрешен первым.

# Copy.FileComment
source: Copying file from "{0}" to "{1}".
de: Die Datei wird von "{0}" in "{1}" kopiert.
ko: Копирование файла из "{0}" в "{1}".
